# we completed Numpy 
## mainly we need to learn 
## DF --> 2D numpy array
## series --> 1D numpy array
## random number

# pandas

In [1]:
import os
os.getcwd()

'C:\\Users\\ramreddymyla\\Google Drive\\01 DS ML DL NLP and AI With Python Lab Copy\\03 Jupyter Notebooks\\Level 04_of_06_Machine_Learning_Algorithms'

In [2]:
os.chdir("C:\\Users\\ramreddymyla\\Google Drive\\01 DS ML DL NLP and AI With Python Lab Copy\\02 lab data\\python")

In [3]:
os.getcwd()

'C:\\Users\\ramreddymyla\\Google Drive\\01 DS ML DL NLP and AI With Python Lab Copy\\02 lab data\\python'

# read csv file and create df

In [6]:
import pandas as pd
df =pd.read_csv("pandas_sales.csv")

In [7]:
df

  month  eggs  salt  spam
0   Jan    47  12.0    17
1   Feb   110  50.0    31
2   Mar   221  89.0    72
3   Apr    77  87.0    20
4   May   132   NaN    52
5   Jun   205  60.0    55

In [8]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [9]:
df = pd.read_csv("pandas_sales.csv",
                 index_col="month")

In [10]:
df.index

Index(['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun'], dtype='object', name='month')

In [11]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Jan to Jun
Data columns (total 3 columns):
eggs    6 non-null int64
salt    5 non-null float64
spam    6 non-null int64
dtypes: float64(1), int64(2)
memory usage: 192.0+ bytes

In [14]:
df.head() # top 5 records

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52

In [15]:
df.tail() # bottom 5 records

       eggs  salt  spam
month
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [16]:
np_2d_array=df.values

In [17]:
np_2d_array

array([[ 47.,  12.,  17.],
       [110.,  50.,  31.],
       [221.,  89.,  72.],
       [ 77.,  87.,  20.],
       [132.,  nan,  52.],
       [205.,  60.,  55.]])

In [18]:
np_2d_array.ndim

2

In [19]:
np_2d_array.shape #(n_samples,n_features)

(6, 3)

# read df

In [20]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

## method 1: read by  index(row name) and column name

In [21]:
# print 47

In [23]:
df["eggs"]["Jan"] # [column name][row name/index]

47

In [24]:
# slice and fancy methods not possible on columns

In [27]:
df["eggs"]["Jan":"Apr"] # [column name][row name/index]

month
Jan     47
Feb    110
Mar    221
Apr     77
Name: eggs, dtype: int64

## method 2: attribute followed by index

In [28]:
df.eggs

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [32]:
df.eggs[0] # particular value

47

In [29]:
df.eggs[0:2] # slice

month
Jan     47
Feb    110
Name: eggs, dtype: int64

In [31]:
df.eggs[[0,5]] # fancy

month
Jan     47
Jun    205
Name: eggs, dtype: int64

# method 3: loc method/ label method

In [34]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [35]:
# print 47
df.loc["Jan","eggs"] # row label ,column label

47

In [36]:
df.loc["Jan":"Mar","eggs"] # slice on index/rows

month
Jan     47
Feb    110
Mar    221
Name: eggs, dtype: int64

In [37]:
df.loc["Jan":"Mar","eggs":"spam"] # slice on index and columns too

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72

In [39]:
df.loc[["Jan","Mar"],["eggs","spam"]] # fancy index and columns wise

       eggs  spam
month
Jan      47    17
Mar     221    72

In [40]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [42]:
df.loc[[True,False,False,False,False,True]] # this is called bool way of reading 
# based on this method only filters are working

       eggs  salt  spam
month
Jan      47  12.0    17
Jun     205  60.0    55

In [43]:
# get rows where salt is > 80

In [44]:
df.salt>80

month
Jan    False
Feb    False
Mar     True
Apr     True
May    False
Jun    False
Name: salt, dtype: bool

In [45]:
df[df.salt>80]

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

# method 4: iloc

In [46]:
# index location

In [48]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [49]:
#print 47
df.iloc[0,0] # row index number ,column index number

47

In [50]:
df.iloc[0:2,0] # row wise slice

month
Jan     47
Feb    110
Name: eggs, dtype: int64

In [51]:
df.iloc[0:4,0:2] # slice

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0

In [53]:
df.iloc[[0,4],[0,2]] # fancy

       eggs  spam
month
Jan      47    17
May     132    52

In [54]:
# out of these 4 methods ,try to use iloc

# create sub df from df

In [55]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [56]:
id(df)

2472720375880

In [57]:
# memory location is 2472720375880

In [58]:
sub_df=df[["eggs","salt"]]

In [59]:
type(sub_df)

pandas.core.frame.DataFrame

In [60]:
sub_df

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN
Jun     205  60.0

In [61]:
id(sub_df)

2472716333800

In [63]:
# create series
#series = 1 column + index

In [64]:
s= df.eggs

In [65]:
type(s)

pandas.core.series.Series

In [66]:
s # index(month) + 1 col(eggs)

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [67]:
# series can be converted to -----array

In [68]:
np_1d_array=s.values

In [69]:
np_1d_array.ndim

1

In [70]:
np_1d_array.shape

(6,)

In [71]:
np_1d_array

array([ 47, 110, 221,  77, 132, 205], dtype=int64)

In [72]:
df = pd.read_csv("iris.csv")

In [73]:
df.head() # top 5 rows

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
sepal_length    150 non-null float64
sepal_width     150 non-null float64
petal_length    150 non-null float64
petal_width     150 non-null float64
species         150 non-null object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [74]:
# X = first 4 columns i want

In [78]:
type(df.columns)

pandas.core.indexes.base.Index

In [82]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [81]:
df.columns[1]

'sepal_width'

In [88]:
X= df[['sepal_length', 'sepal_width', 'petal_length', 'petal_width']]

In [90]:
type(X)

pandas.core.frame.DataFrame

In [91]:
X.head()

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2

In [86]:
#syntax
#df.loc[rows labels ,columns labels]
X= df.loc[:,df.columns[:4]]

In [87]:
X # independent variables

     sepal_length  sepal_width  petal_length  petal_width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

In [93]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [98]:
df[df.sepal_length>7]

     sepal_length  sepal_width  petal_length  petal_width    species
102           7.1          3.0           5.9          2.1  virginica
105           7.6          3.0           6.6          2.1  virginica
107           7.3          2.9           6.3          1.8  virginica
109           7.2          3.6           6.1          2.5  virginica
117           7.7          3.8           6.7          2.2  virginica
118           7.7          2.6           6.9          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
125           7.2          3.2           6.0          1.8  virginica
129           7.2          3.0           5.8          1.6  virginica
130           7.4          2.8           6.1          1.9  virginica
131           7.9          3.8           6.4          2.0  virginica
135           7.7          3.0           6.1          2.3  virginica

In [99]:
type(df[df.sepal_length>7])

pandas.core.frame.DataFrame

In [100]:
df[df.sepal_length>7].sepal_width

102    3.0
105    3.0
107    2.9
109    3.6
117    3.8
118    2.6
122    2.8
125    3.2
129    3.0
130    2.8
131    3.8
135    3.0
Name: sepal_width, dtype: float64

# filters

* where in sql

In [110]:
df=pd.read_csv("pandas_sales.csv",index_col=0)

In [111]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [112]:
# create same copy into another df

In [113]:
df2=df.copy()

In [114]:
id(df)

2472751196312

In [115]:
id(df2)

2472731411680

In [120]:
df.iloc[0,0]=48

In [121]:
df

       eggs  salt  spam
month
Jan      48  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [122]:
df2

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [123]:
df ==df2

        eggs   salt  spam
month
Jan    False   True  True
Feb     True   True  True
Mar     True   True  True
Apr     True   True  True
May     True  False  True
Jun     True   True  True

# add 1 column to df

In [124]:
df

       eggs  salt  spam
month
Jan      48  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [125]:
df["cake"]=[0,0,10,20,30,40]

In [126]:
df

       eggs  salt  spam  cake
month
Jan      48  12.0    17     0
Feb     110  50.0    31     0
Mar     221  89.0    72    10
Apr      77  87.0    20    20
May     132   NaN    52    30
Jun     205  60.0    55    40

In [127]:
# all, any

In [129]:
df["milk"]=[0,0,0,0,0,0]

In [130]:
df

       eggs  salt  spam  cake  milk
month
Jan      48  12.0    17     0     0
Feb     110  50.0    31     0     0
Mar     221  89.0    72    10     0
Apr      77  87.0    20    20     0
May     132   NaN    52    30     0
Jun     205  60.0    55    40     0

In [133]:
# Return whether all elements are True(other than zero)

In [135]:
0==False

True

In [136]:
1==True

True

In [138]:
df.loc[:,df.all()] # only all valid columns(column which has no zero)

       eggs  salt  spam
month
Jan      48  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [140]:
#df.any?Return whether any element is True

In [141]:
df

       eggs  salt  spam  cake  milk
month
Jan      48  12.0    17     0     0
Feb     110  50.0    31     0     0
Mar     221  89.0    72    10     0
Apr      77  87.0    20    20     0
May     132   NaN    52    30     0
Jun     205  60.0    55    40     0

In [142]:
df.loc[:,df.any()]

       eggs  salt  spam  cake
month
Jan      48  12.0    17     0
Feb     110  50.0    31     0
Mar     221  89.0    72    10
Apr      77  87.0    20    20
May     132   NaN    52    30
Jun     205  60.0    55    40

# createing simple dataframe manually

In [143]:
import pandas as pd
sales = pd.DataFrame({
'weekday': ['Sun', 'Sun', 'Mon', 'Mon'],
'city': ['Austin', 'Dallas', 'Austin', 'Dallas'],
'bread': [139, 237, 326, 456],
'butter': [20, 45, 70, 98]
})

In [144]:
sales

  weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45
2     Mon  Austin    326      70
3     Mon  Dallas    456      98

In [147]:
type(sales[["bread","butter"]])

pandas.core.frame.DataFrame

In [149]:
sales[["bread","butter"]].sum()

bread     1158
butter     233
dtype: int64

In [150]:
type(sales[["bread","butter"]].sum())

pandas.core.series.Series

In [151]:
sales[["bread","butter"]].sum().sum()

1391

In [152]:
# in my business on two products ,total received 1391

In [153]:
# only bread sales i want

In [154]:
sales

  weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45
2     Mon  Austin    326      70
3     Mon  Dallas    456      98

In [156]:
sales.bread.sum()

1158

In [157]:
# in bread what is the min sales

In [158]:
sales.bread.min()

139

In [159]:
# weekday wise sum of sales of bread

In [161]:
sales.groupby("weekday")["bread"].sum()
# groupby may have multiple columns
# metrics may have multiple columns
# agg fun may have multiple fun

weekday
Mon    782
Sun    376
Name: bread, dtype: int64

In [162]:
sales.groupby("weekday")["bread","butter"].sum()

         bread  butter
weekday
Mon        782     168
Sun        376      65

In [164]:
sales.groupby("weekday")["bread","butter"].agg([sum,min,max])

        bread           butter
          sum  min  max    sum min max
weekday
Mon       782  326  456    168  70  98
Sun       376  139  237     65  20  45

In [165]:
# create your own function and pass it

In [166]:
def range_of_sales(arg1_series):
    return arg1_series.max()-arg1_series.min()

In [168]:
sales.groupby("weekday")["bread","butter"].agg([min,max,range_of_sales])

        bread                     butter
          min  max range_of_sales    min max range_of_sales
weekday
Mon       326  456            130     70  98             28
Sun       139  237             98     20  45             25